# pandas DataFrame
DataFrame is 2 demensial stucture looks like a table, that include rows and columns. Colums is "Series" objects and rows are "Series's" objects. DataFrame also has labels (index), that correspond to each row in the table.

In [57]:
import pandas as pd

### to add DateFrame

way with use a dict

In [58]:
countries_df = pd.DataFrame({
    'countr':['Англия', 'Канада', 'США', 'Россия', 
              'Украина', 'Беларусь', 'Казахстан'],
    'population':[56.29, 38.05, 322.28, 146.24, 
                  45.5, 9.5, 17.04],
    'area':[133396, 9984670, 9826630, 17125191, 
    603628, 207600, 2724902],
})
display(countries_df)
countries_df.index = ['UK', 'CA', 'US', 'RU', 'UA', 'BY', 'KZ']
display(countries_df)

      countr  population      area
0     Англия       56.29    133396
1     Канада       38.05   9984670
2        США      322.28   9826630
3     Россия      146.24  17125191
4    Украина       45.50    603628
5   Беларусь        9.50    207600
6  Казахстан       17.04   2724902

       countr  population      area
UK     Англия       56.29    133396
CA     Канада       38.05   9984670
US        США      322.28   9826630
RU     Россия      146.24  17125191
UA    Украина       45.50    603628
BY   Беларусь        9.50    207600
KZ  Казахстан       17.04   2724902

way with use a list

In [59]:
countries_df_0 = pd.DataFrame(
    data=[['Англия', 56.29, 133396],
          ['Канада', 38.05, 9984670],
          ['США', 322.28, 9826630],
          ['Россия', 146.24, 17125191],
          ['Украина', 45.5, 603628],
          ['Беларусь', 9.5, 207600],
          ['Казахстан', 17.04, 2724902]
         ],
    columns=['country', 'population', 'area'],
    index=['UK', 'CA', 'US', 'RU', 'UA', 'BY', 'KZ'] 
)
display(countries_df_0)

      country  population      area
UK     Англия       56.29    133396
CA     Канада       38.05   9984670
US        США      322.28   9826630
RU     Россия      146.24  17125191
UA    Украина       45.50    603628
BY   Беларусь        9.50    207600
KZ  Казахстан       17.04   2724902

### axis

axis=0 axis by rows

In [60]:
countries_df_0.mean(axis=0, numeric_only=True)

population    9.070000e+01
area          5.800860e+06
dtype: float64

axis=1 axis by columns

In [61]:
countries_df_0.mean(axis=1, numeric_only=True)

UK      66726.145
CA    4992354.025
US    4913476.140
RU    8562668.620
UA     301836.750
BY     103804.750
KZ    1362459.520
dtype: float64

### access to data

access by name

In [62]:
display(countries_df.area)
display(countries_df.population)

UK      133396
CA     9984670
US     9826630
RU    17125191
UA      603628
BY      207600
KZ     2724902
Name: area, dtype: int64

UK     56.29
CA     38.05
US    322.28
RU    146.24
UA     45.50
BY      9.50
KZ     17.04
Name: population, dtype: float64

access by index

In [63]:
display(countries_df['area'])
display(countries_df['population'])

UK      133396
CA     9984670
US     9826630
RU    17125191
UA      603628
BY      207600
KZ     2724902
Name: area, dtype: int64

UK     56.29
CA     38.05
US    322.28
RU    146.24
UA     45.50
BY      9.50
KZ     17.04
Name: population, dtype: float64

.loc

In [64]:
print(countries_df.loc['RU', 'area'])
print(countries_df.loc['RU', ['population', 'area']])

17125191
population      146.24
area          17125191
Name: RU, dtype: object

.iloc

In [65]:
display(countries_df.iloc[0:2])
display(countries_df.iloc[2:,:2])
display(countries_df.iloc[2:, 0::2])

    countr  population     area
UK  Англия       56.29   133396
CA  Канада       38.05  9984670

       countr  population
US        США      322.28
RU     Россия      146.24
UA    Украина       45.50
BY   Беларусь        9.50
KZ  Казахстан       17.04

       countr      area
US        США   9826630
RU     Россия  17125191
UA    Украина    603628
BY   Беларусь    207600
KZ  Казахстан   2724902

### DataFrame practice

Write the function, that takes three lists as input: "Income", "Expenses" and "Years". The function returns DataFrame.
* use list "Years" as index

In [66]:
income = [478, 512, 196]
expenses = [156, 130, 270]
years = [2018, 2019, 2020]

In [67]:
def create_companyDF(income, expenses, years):
    result = pd.DataFrame({
        "income":[*income],
        "expenses":[*expenses],
    })
    result.index = [*years]
    return result

In [80]:
df = create_companyDF(income, expenses, years)
year = 2025
display(df.index)

Index([2018, 2019, 2020], dtype='int64')

Write the function, that takes DataFrame table and year sa input. The function returns a difference between income and expenses.
* the fuction must return "None", if year isn't exsist in table

In [88]:
def get_profit(df, year):
    if year in df.index:
        return df.loc[year, 'income'] - df.loc[year, 'expenses']
    return None
display(get_profit(df, 2021))

None